Kreyl/obd2-instruments/obd2-instruments/PIC18/cougarlcd.c
/* cougarlcd.c: Translation of the Cougar LCD code from ASM to C. */
/*
  Written 2011 by Donald Becker and Hugo William Becker, based on
  ASM code written by Chris Freyman.

  This file contains a translation from 'cougarlcd_v1_4b.ASM' to C.
  We wrote this to understand and support the hardware platform with
  our OBD2-instruments system.  A independently written source file
  implements similar functionality with the addition of CAN support.

  The build environment is the SDCC compiler, with its library and
  include files.
  See the bottom of the file for the basic compiler command line.
  The processor family and part number is set on the command line.
  Note that __naked functions in SDCC have no prologue or postlogue
  thus need an explict __asm return __endasm;
*/

#include <stdint.h>
#include <pic18fregs.h>

/* I/O pin assignments. */
#define SW1 (PORTBbits.RB0_PORTB)
#define LCD (PORTB)				/* Only upper nibble connected. */
#define SW2 (PORTAbits.RA4)
#define RLED  (PORTCbits.RC0)
#define GLED  (PORTCbits.RC1)
#define ALRM  (PORTCbits.RC3)
#define RS PORTCbits.RC4		/* LCD Register Select (Instruction/Data). */
#define E  PORTCbits.RC5		/* LCD Enable pin, latched on high->low */

#define F_CPU 8000000			/* CPU oscillator frequency. */

#if defined SDCC
/* The SDCC and PIC compiler-fu.
 * This magic communicates the processor "fuse" configuring settings to the
 * programmer.  This info is used to configure pre-execution settings such
 * as the hardware clock source.
 */

code char at __CONFIG1H conf1 = _OSC_HS_1H & _FCMEN_OFF_1H & _IESO_OFF_1H;
code char at __CONFIG2L conf2l = _PWRT_ON_2L & _BOREN_OFF_2L & _BORV_2_2L;
code char at __CONFIG2H conf2h = _WDT_OFF_2H & _WDTPS_1024_2H;
code char at __CONFIG3H conf3h =
	_MCLRE_ON_3H & _LPT1OSC_OFF_3H & _PBADEN_OFF_3H;
/* Some installations will want to enable LVP -- low voltage programming
 * that uses operating voltage instead of 14V for flash programming. */
code char at __CONFIG4L conf4l =
	_DEBUG_OFF_4L & _XINST_OFF_4L & _LVP_OFF_4L & _STVREN_OFF_4L;
/* No code read protection -- CONFIG5 could be left at the default. */
code char at __CONFIG5L conf5l = _CP0_OFF_5L & _CP1_OFF_5L;
code char at __CONFIG5H conf5h = _CPB_OFF_5H & _CPD_OFF_5H;
/* Nor do we need write protection set in CONFIG6. */
code char at __CONFIG6L conf6l = 0xFF;
code char at __CONFIG6H conf6h = 0xFF;
/* CONFIG7 blocks table reads -- turn off. */
code char at __CONFIG7L conf7l = _EBTR0_OFF_7L & _EBTR1_OFF_7L;
code char at __CONFIG7H conf7h = 0xFF;

#pragma std_sdcc99 

#pragma stack 0x200 64
#if 0							/* We don't need to modify the stack */
#endif

/* Instructions that should be in a header file. */
#define swapf(nibblepair)  { __asm SWAPF _##nibblepair , W __endasm;}
#define naked_return  __asm RETFIE __endasm
#else
#warning Unknown compiler. PIC18 configuration space initialization omitted.
#endif

typedef union uint24_un {
	struct {
		uint8_t L, M, H;
	};
	struct {
		uint16_t ML;
		uint8_t High;
	};
	struct {
		uint16_t Low;
		uint8_t HM;
	};
} uint24_t;

#if ! defined(USE_DEFINE_NOT_CONST)
/* Constants used at run time. */
static const uint8_t MT_Max = 200; /* max motor temp for error LED */
static const uint8_t CT_Max = 167; /* max controller temp for error LED */
static const uint8_t BT_Max = 125; /* max battery temp for error LED */
/* Traction battery capacity in Amp/seconds (only high/mid byte of 24-bit) */
static const uint8_t bcapacityM = 0x5E;
static const uint8_t bcapacityH = 0x06;
static const uint8_t pmile = 32;
static const char PWM_Max = 0xFF;
static const uint8_t Sysval = 0x80;
static const uint8_t ALRM_lim = 21; /* Percentage SOC where alarm is tripped */
/* Length of Profile 1 message that establishes offset to access Profile 2 */
static const char PF2_Offset = 26;

/* Adjustment for pack voltage.  This also corrects for minor gain
 * transfer error in HCNR201. Value=correction x 10 */
/* Adjustment for accessory voltage: compensate for diode drop of D1.
 * Value=correction x 100 */
const int8_t Vpack_trim = 0, Vacc_trim = 70;
/* Scale for motor amps and battery amps from serial message.
 * Value/16= scale. Value of 16 is 1:1, 20 is 1.25:1,etc */
static const char sAmp_scale = 16;
/* Battery amp charge efficiency. 16=100%, 15=94%, 14=87.5%, 13=81%, 12=75% */
static const char cEfficiency = 15;
/* Charge amp level where cTime stops incrementing & mode LED stops blinking */
static const char min_cAmp = 1;
 /* Update rate for displayed information.
  * 1= same as old software. 50=updates once per second */
static const uint8_t D_refresh = 1;
#else
/* Constants used at run time. */
#define MT_Max  200 /* max motor temp for error LED */
#define CT_Max  167 /* max controller temp for error LED */
#define BT_Max  125 /* max battery temp for error LED */
#define bcapacityM  0x5E
#define bcapacityH  0x06
#define pmile  32
#define PWM_Max  0xFF
#define Sysval  0x80 /* Bitmap w/ only high P compensation set. */
#define ALRM_lim  21 /* Percentage SOC where alarm is tripped */
/* Length of Profile 1 message that establishes offset to access Profile 2 */
#define PF2_Offset  26

/* Adjustment for pack voltage.  This also corrects for minor gain
 * transfer error in HCNR201. Value=correction x 10 */
/* Adjustment for accessory voltage: compensate for diode drop of D1.
 * Value=correction x 100 */
#define Vpack_trim 0
#define Vacc_trim  70
/* Scale for motor amps and battery amps from serial message.
 * Value/16= scale. Value of 16 is 1:1, 20 is 1.25:1,etc */
#define sAmp_scale  16
/* Battery amp charge efficiency. 16=100%, 15=94%, 14=87.5%, 13=81%, 12=75% */
#define cEfficiency  15
/* Charge amp level where cTime stops incrementing & mode LED stops blinking */
#define min_cAmp  1
 /* Update rate for displayed information.
  * 1= same as old software. 50=updates once per second */
#define D_refresh  1
#endif

static void INIT_LCD(void);
static void SECOND_LINE(void);
static void COMMAND(uint8_t cmd) __wparam;
static void COMMAND8(uint8_t command) __wparam;
static void DISPLAY(char c) __wparam;
static void A2DLoop(void);
static void A2DAVG(void);
static void Hysteresis(void);
static void RXconvrt(void);
static void mAmp_stat(void);
static void MDELAY(uint8_t microseconds) __wparam;
static void MS_DELAY(char tens_of_milliseconds) __wparam;
static void Hex2BCD(void);
static void BCD2Hex(void);
static void Fracmult(uint8_t fraction4_4)  __wparam;/* Call-return in Arg2 */
static char GetChar(void);
static char GetTemp(void);
static char GetTX(void);
static void SOC_Calc(void);
static void Range(void);
static uint8_t CapTempAdj(void);
static char Zerosupress(void);
static void Button(void);
static void TX_Mode(void);
static uint8_t F2C(uint8_t fahrenheit) __wparam;
static void Capstore(void);
static void EEsave(void);
static uint8_t EERead(uint8_t index) __wparam;

/* Calculate the moving average, using AVG_FACTOR as the decay period. */
static uint16_t ADC_average(uint16_t running_avg, uint8_t avg_factor);

