Kreyl/obd2-instruments/obd2-instruments/PIC18/cougarlcd.c
/* Commands for HD44780 LCD controllers. */
enum LCD_commands {
	CLRSCR=1, HOME=2,
	OFF=0x08, ON=0x0C,		/* Underline and blink off */
	LEFT=0x18, RIGHT=0x1C,	/* Display shift  0x10/14 for cursor move */
	LCD_4bit=0x20,			/* Use 4 bit interface */
	LIN2=0xC0
};

/* cblock  0x00 */
/* Locations for saving context during interrupts. */
static uint8_t W_TEMP, STATUS_TEMP, BSR_TEMP, Off_temp, Off_tempH;
static uint16_t Ptr_temp, PROD_temp, Arg2_temp, temp;
static int16_t avg;

/* cblock  0x1A */
char CNT, CNT1, CNT2, CNT3, CNT4, CNT_Temp;
uint16_t Num;
char Dig4, Dig3, Dig2, Dig1;
char Digtemp;
uint8_t Offset, OffsetH;		/* Typically used as 8 bits. */
uint16_t Temp_ptr;
uint8_t Messnum;					/* Message number */
uint16_t mAmp, bAmp, bcAmp, avolt;
uint8_t capacityH;
uint16_t capacity;
uint8_t SOC, SOC_temp;
char Miles;
uint8_t FG_Scale, bTemp;
uint16_t cTemp;
uint8_t mTemp;
uint16_t Volt;
char Dec1, Dec2, Dec3;
char CHAR1, CHAR2, CHAR3, CHAR4, CHAR5, CHAR6, CHAR7, CHAR8, CHAR9;
uint16_t Hex, Arg2;
char RES0, RES1, RES2, RES3;
int8_t captempH;
uint16_t captemp, bAmptemp;
int8_t LCDtemp, RX_temp, RX_count, EE_count;
union Sys_Config_type {				/* System status flags */
	struct {
		unsigned DisplayMode: 1; /*  */
		unsigned b1: 1; /*  */
		unsigned bAmpSource:  1; /* Battery amp source.
								  * 0=local A/D , 1=motor controller */
		unsigned UseMetric 	: 1;	 /* Display metric units */
		unsigned PeukertRange0: 1;	 /* Peukert exponent 1.20 */
		unsigned PeukertRange1: 1;	 /* Peukert bypass w/ 1,1 */
		unsigned bAmp300mVOffset : 1;	/* Do battery amp 300mV correction */
		unsigned PeukertRangeHigh: 1;	/* Set high exponent range */
	};
	uint8_t byte;				/* Clear or set as whole byte. */
} Sys_Config;
uint16_t pdiv, pct20, Vavg, aVavg, Bavg;
uint8_t Disp_count, Avg_div;
uint8_t Captempcomp;

union LZstat_type {				/* System status flags */
	struct {
		unsigned LeadingZero: 1; /* Supress leading zeros */
		unsigned ProfileMode: 1; /* Profile mode */
		unsigned ChargeMode	: 1; /* Charge mode */
		unsigned NegTemp   	: 1; /* Negative temperature */
		unsigned Overtemp  	: 1; /* Overtemperature */
		unsigned mtrAmpsLow	: 1; /* Motor current is negligible */
		unsigned TermCount 	: 1; /* Terminal count */
		unsigned CommErr   	: 1; /* Communications error. */
	};
	uint8_t byte;				/* Clear or set as whole byte. */
} LZstat;
uint8_t C_hours, C_minutes, CM_Delay, RF_Count;

#if 0							/* Initialization for the EEPROM */
#pragma udata eedata  _eeprom_init 
uint8_t eeprom_init[] = { 0x00, 0x06, 0x5e };
#endif

/* Interrupt vectors.  By default the compiler pushes a bunch of state
 * onto the stack.  To avoid this overhead we must use __naked, but that
 * eliminate the automatic vector entry.  So we construct it
 * manually. */

void START(void) __naked;
void HIGH_ISR(void) __naked;
void LOW_ISR(void) __naked;

void RES_VECT(void) __naked __interrupt 0
{ __asm goto _START;  __endasm; }
void ISRH(void) __naked __interrupt 1
{ __asm goto _HIGH_ISR;  __endasm; }
void ISRL(void) __naked __interrupt 2
{ __asm goto _LOW_ISR;  __endasm; }

/* High priority interrupt service routine used for serial port receive
 * from controller.  This is hard-coded to recognize the Cougar "real time
 * display" format, and fragile because if it.
 */
void HIGH_ISR(void) __naked
{
	/* Save the W/working, status and bank select registers */
	PIR1bits.RCIF = 0;
	if (RX_count == 0)
		LZstat.CommErr = 0;
	RX_count++;
	if (RCSTAbits.FERR)
		LZstat.CommErr = 1;
	RX_temp = RCREG;
	if (RX_temp != 0x0A) {
		switch(RX_count) {
		case 18: CHAR3 = RX_temp; break;
		case 19: CHAR2 = RX_temp; break;
		case 20: CHAR1 = RX_temp; break;
		case 33: CHAR6 = RX_temp; break;
		case 34: CHAR5 = RX_temp; break;
		case 35: CHAR4 = RX_temp; break;
		case 54: CHAR9 = RX_temp; break;
		case 55: CHAR8 = RX_temp; break;
		case 56: CHAR7 = RX_temp; break;
		}
	} else {
		if (RX_count == 67)
			LZstat.CommErr = 1;
		RX_count = 0;
	}
#if 0
	{
		if (RX_count == 18) {
			CHAR3 = RX_temp;
			return;
		}
		if (RX_count == 19) {
			CHAR2 = RX_temp;
			return;
		}
		if (RX_count == 20) {
			CHAR1 = RX_temp;
			return;
		}
		if (RX_count == 33) {
			CHAR6 = RX_temp;
		}
		if (RX_count == 34) {
			CHAR5 = RX_temp;
		}
	}
#endif
	/* ToDo: Restore the W/working, status and bank select registers */
	naked_return;
}

/* The "low priority" interrupt is used for the 1Hz timer. */
void LOW_ISR() __naked
{
	/* Save the W/working, status and bank select registers */
	W_TEMP = WREG;
	STATUS_TEMP = STATUS;
	BSR_TEMP = BSR;
	/* Save other variables. */
	Off_temp = Offset;
	Off_tempH = OffsetH;
	PROD_temp = PROD;
	CNT_Temp = CNT;
	Arg2_temp = Arg2;

	T0CONbits.TMR0ON = 0;		/* Disable timer0 */
	INTCONbits.TMR0IF = 0;		/* Clear timer0 interrupt flag */

	if (CM_Delay) CM_Delay--;
	if ( ! LZstat.ChargeMode) {	/* Driving/discharge mode. */
		if (bAmp <= 1) {		/* If nearly discharged skip SoC adjust */
			bAmptemp = bAmp;
			bAmptemp >>= 3;
			/* At low reserve capacity we don't do Peukert adjustment. */
			if (bAmptemp == 0) {
				RES0 = bAmp;
				RES1 = 0;
			} else {
				if (bAmptemp >= 48)
					bAmptemp = 48;
				Offset = bAmptemp;
#if 0
				if (Sys_Config.Peukert1_20)
					if (Sys_Config.PeukertBypass)
						;
				/* ToDo: fill in logic for Peukert table selection. */
				/* ToDo: line 427 */
#endif
				Offset += 85;
				Arg2 = bAmp;
				Fracmult(GetChar());
			}
			capacity -= RES0 + RES1<<8;
			EE_count++;
			/* Backup capacity to EEPROM every minute. */
			if (EE_count >= 60)
				Capstore();
		}
		/* Alarm */
		if (SOC < ALRM_lim) {
			ALRM ^= 1;
			RLED ^= 1;
		}
		/* mAmp_test */
		if (LZstat.mtrAmpsLow == 0 ||
			LZstat.TermCount == 0 ||
			Disp_count < 6) {
			Disp_count++;
			if (Disp_count == 5)
				LZstat.TermCount = 1;
		}
	} else {					/* Charging mode */
		if (bAmp > min_cAmp) {
			GLED ^= 1;
			if (++EE_count > 59) {
				Capstore();
				C_minutes++;
				if (C_minutes == 60) {
					C_hours++;
					C_minutes = 0;
				}
			}
			if (SOC >= 100) {
				Arg2 = bAmp;
				Fracmult(cEfficiency);
				capacity += RES0;			/* Todo: Carry into capacityH.  check RES0 result return */
			}
		}
	}

	/* Set timer period to 34285 = 0x85ED. */
	TMR0L = 0xED;
	TMR0H = 0x85;

	/* Restore the W/working, status and bank select registers */
	WREG = W_TEMP;
	STATUS = STATUS_TEMP;
	BSR = BSR_TEMP;
	/* Restore other variables.
	 * These could have been only selectively saved. */
	Offset = Off_temp;
	OffsetH = Off_tempH;
	PROD = PROD_temp;
	CNT = CNT_Temp;
	Arg2 = Arg2_temp;
	T0CONbits.TMR0ON = 1;		/* Enable timer0 */

