Kreyl/obd2-instruments/obd2-instruments/PIC18/cougarlcd.c
	naked_return;
}

void START(void) __naked
{
	/* Initialize ports. */
	/* Select the external OSC1 8MHz crystal. */
	OSCCON = 0x74;
	PORTC = 0;
	PORTA = 0;
	PORTB = 0;
	SSPCON1bits.SSPEN = 0;		/* Disable serial port */
	TRISB = 0x0F;				/* Upper 4 bits LCD control.  B0 pushbutton */
	TRISC = 0x80;				/* Serial port (B7,B6) LED drive, LCD select */
	TRISA = 0x3F;				/* Analog and pushbutton inputs */
	/* Set the ADC to Vdd/Vss reference, AN0..AN5 as anal og inputs. */
	ADCON1 = 0x0A;
	/* Initialize the USART */
	BAUDCON = 0;				/* Async 8 bit mode. */
	SPBRG = 0x19;
	TXSTA = 0xA4;
	RCSTA = 0x10;				/* Leave reset. */
	PIR2 = PIR1 = 0;
	PIE1 = 0x20;
	PIE2 = 0;
	/* Setup interrupts. */
	INTCON = 0xE0;				/* Enable intrs: peripherals and timer0 */
	RCONbits.IPEN = 1;			/* Set interrupt priority mode */
	IPR1bits.TXBIP = 1;			/* Set UART as a high priority interrupt. */
	INTCON2bits.TMR0IP = 0;		/* Set timer0 as a low priority interrupt. */
	MS_DELAY(20);				/* 200msec wait.  Power-up delay for LCD?  */
	INIT_LCD();
	COMMAND(CLRSCR);
	MS_DELAY(20);				/* Another 200msec wait */
	/* Clear all variables, painfully one-by-one. */
	Messnum = RX_count = Disp_count = mAmp = cTemp =
		bcAmp = LZstat.byte = C_hours = C_minutes = RF_Count = 0;
	CHAR1 = CHAR2 = CHAR3 = CHAR4 = CHAR6 = CHAR7 = CHAR8 = CHAR9 = 0;
	CHAR5 = 6;
	Sys_Config.byte = Sysval;
	CM_Delay = 2;				/* Set charge mode enable delay timer */
	/* Fuel Gauge PWM output */
	TRISCbits.TRISC2 = 1;
	PR2 = 0xFF;
	CCP1CON = 0x2C;
	CCPR1L = PWM_Max;
	T2CON = 6;
	TRISCbits.TRISC2 = 0;
	/* Setup timer. */
	T0CON = 5;
	TMR0L = 0xED;
	TMR0H = 0x85;
	EE_count = 0;
	/* Test for SoC reset request: switch 1 pressure during reset . */
	if ( ! SW1) {
		/* Read in stored capacity */
		capacityH = EERead(1);
		capacity = EERead(2)<<8;
	} else {
		char c;
		capacityH = bcapacityH;
		capacity = bcapacityM<<8;
		Capstore();
		Offset = 54;			/* " RESETTING SOC " message */
		while ((c = GetChar()) != 0) {
			DISPLAY(c);
			Offset++;
		}
	}
	CNT1 = CNT = 0;
	captempH = bcapacityH;
	captemp = bcapacityM<<8;		/* Should be a 24bit copy w/ low byte 0 */
	while ((captemp -= 100) > 0)
		CNT++;
	pdiv = CNT;

    /* Determine 20% capacity values for capacityH/M using divisors */
	CNT = 0;
	captempH = bcapacityH;
	captemp = bcapacityM<<8;		/* Should be a 24bit copy w/ low byte 0 */
	do {
		captemp -= pdiv;				/* Missing propagate borrow captempH */
	} while (++CNT < 80);
	pct20 = (captempH<<8) + (captemp>>8);

	/* Enable timer 0 */
	T0CONbits.TMR0ON = 1;

    /* Test for Fuel Gauge calibration request */
	if (SW2) {
		T0CONbits.TMR0ON = 0;	/* Stop timer, even though just started */
		INTCONbits.TMR0IF = 0;	/* Clear timer0 interrupt flag */
		capacityH = pct20>>8;	/* capacity24bits = pct20<<8; */
		capacity = pct20<<8;
		Messnum = 0;			/* Pointless, zeroed above. */
		while (SW2)				/* Wait for pushbutton release. */
			;
	}

	OffsetH = Offset = 0;
	COMMAND(HOME);

	ADCON0 = 0x11;				/* ADC4, battery temperature */
	ADCON0bits.GO_DONE = 1;
	while (! ADCON0bits.GO_DONE)
		;
	Captempcomp = ADRESH;
	RCSTAbits.SPEN = 1;			/* Enable serial receive. */
	WDTCONbits.SWDTEN = 1;		/* Enable watchdog timer. */

	/* Main operation loop. */
	do {
		ClrWdt();
		MS_DELAY(1);
		if (RCSTAbits.OERR) {
			RCSTAbits.CREN = 0;		/* Restart to clear overflow. */
			LZstat.CommErr = 1;
			RCSTAbits.CREN = 1;		/* Restart to clear overflow. */
		}
		if (RX_count == 0)
			RXconvrt();
		A2DLoop();
		SOC_Calc();

		Temp_ptr = mTemp;
		if (Temp_ptr < 20)
			Temp_ptr = 20;
		Temp_ptr -= 20;
		mTemp = GetTemp();
		Temp_ptr = bTemp;
		if (Temp_ptr < 20)
			Temp_ptr = 20;
		Temp_ptr -= 20;
		bTemp = GetTemp();

		if (SW1)
			Button();
		if (SW2)
			TX_Mode();
		RLED = 0;
		if (mTemp >= MT_Max || bTemp >= BT_Max || cTemp > CT_Max) {
			RLED = 1;
			/* Set overtemp status */
			if (Sys_Config.DisplayMode && ! LZstat.Overtemp) {
				LZstat.Overtemp = 1;
				Offset = 36;		/* "Tmot Tcont Tbat " message */
				Messnum = 2;		/* Message number. */
			}
		} else
			LZstat.Overtemp = 0;

		/* Display routine. */
		if (++RF_Count > D_refresh) {
			RF_Count = 0;
			OffsetH = Offset;	/* Save for later */
			if ( ! LZstat.ChargeMode) {
				char c;
				/* Line 1 */
				while ((c = GetChar()) != 0) {
					if (Sys_Config.UseMetric) {
						Digtemp = c;
						if (c == 'M')
							c = 'K';
					}
					DISPLAY(c);
					Offset++;
				}
				/* Line 2 */
				Offset = OffsetH;	/* Saved earlier. */
				SECOND_LINE();
#if 0
				if (Messnum == 2) {
				}
#endif
			} else {			/* Charge mode */
				char c;
				Offset = 70;
				/* Line C1 */
				while ((c = GetChar()) != 0) {
					DISPLAY(c);
					Offset++;
				}
				/* Line C2 */
				Offset = OffsetH;	/* Was this really saved earlier? */
				SECOND_LINE();
				Num = C_hours;
				Hex2BCD();		/* Misnamed, really binary to ASCII */
				DISPLAY(Dig2);
				DISPLAY(Dig1);
				DISPLAY(':');
				Num = C_minutes;
				Hex2BCD();
				DISPLAY(Dig2);
				DISPLAY(Dig1);
				DISPLAY(' ');
				DISPLAY(' ');

				Num = bAmp;
				Hex2BCD();
				LZstat.LeadingZero = 0;
				Digtemp = Dig2;
				DISPLAY(Zerosupress());
				DISPLAY(Dig1);
				DISPLAY(' ');
				DISPLAY(' ');

				Num = SOC;
				Hex2BCD();
				LZstat.LeadingZero = 0;
				Digtemp = Dig3;
				DISPLAY(Zerosupress());
				Digtemp = Dig2;
				DISPLAY(Zerosupress());
				DISPLAY(Dig1);
				DISPLAY('%');
			}
		}
	} while(1);

	/* No exit */
}


/* Note: Either the ASM code has the offsets wrong, or there is
 * silent byte padding. */
const char Text_Table[] =
	"Volts mAmp bAmp \0\0"
	"aVolt  SOC  MTE \0\0"
	"Tmot Tcont Tbat \0\0"
	" RESETTING SOC \0"
	"cTime Amps SOC \0";

#if defined(Sysval) && Sysval >= 128

const uint8_t Peukert_1_30_tbl[] = {			/* Peukert 1.30 multipliers */
	0x12,0x16,0x19,0x1B, 0x1D,0x1E,0x20,0x21,
	0x22,0x23,0x24,0x24, 0x26,0x27,0x28,0x29, /* index 64 */
	0x29,0x2A,0x2B,0x2B, 0x2C,0x2D,0x2D,0x2E,
	0x2E,0x2F,0x30,0x30, 0x31,0x31,0x32,0x32, /* index 80 */
	0x33,0x33,0x34,0x34, 0x34,0x35,0x35,0x35,
	0x36,0x36,0x36,0x37, 0x37,0x37,0x38,0x38, /* index 96 */
};
