Kreyl/obd2-instruments/obd2-instruments/PIC18/cougarlcd.c
const uint8_t Peukert_1_25_tbl[] = {			/* Peukert 1.25 multipliers */
	0x12,0x15,0x17,0x19, 0x1A,0x1B,0x1C,0x1D,
	0x1E,0x1F,0x20,0x20, 0x21,0x22,0x22,0x23,	/* index 112 */
	0x23,0x24,0x24,0x25, 0x25,0x26,0x26,0x26,
	0x27,0x27,0x28,0x28, 0x28,0x29,0x29,0x29,	/* index 128 */
	0x2A,0x2A,0x2A,0x2B, 0x2B,0x2B,0x2B,0x2C,
	0x2C,0x2C,0x2C,0x2D, 0x2D,0x2D,0x2D,0x2D,	/* index 144 */
};
const uint8_t Peukert_1_20_tbl[] = {			/* Peukert 1.20 multipliers */
	0x12,0x14,0x15,0x17, 0x18,0x19,0x1A,0x1A,
	0x1B,0x1B,0x1C,0x1C, 0x1D,0x1D,0x1E,0x1E,	/* index 160 */
	0x1E,0x1F,0x1F,0x1F, 0x1F,0x20,0x20,0x20,
	0x20,0x21,0x21,0x21, 0x21,0x22,0x22,0x22,	/* index 176 */
	0x22,0x23,0x23,0x23, 0x23,0x23,0x24,0x24,
	0x24,0x24,0x24,0x25, 0x25,0x25,0x25,0x25,	/* index 192 */
};
#else
const uint8_t Peukert_1_15_tbl[] = {
	0x11,0x13,0x14,0x15,0x15,0x16,0x17,0x17,
	0x17,0x18,0x18,0x18,0x19,0x19,0x19,0x19,
	0x1A,0x1A,0x1A,0x1A,0x1B,0x1B,0x1B,0x1B,
	0x1B,0x1C,0x1C,0x1C,0x1C,0x1C,0x1C,0x1D,
	0x1D,0x1D,0x1D,0x1D,0x1D,0x1D,0x1D,0x1E,
	0x1E,0x1E,0x1E,0x1E,0x1E,0x1E,0x1E,0x1E
};
const uint8_t Peukert_1_10_tbl[] = {
	0x11,0x12,0x12,0x13,0x13,0x14,0x14,0x14,
	0x15,0x15,0x15,0x15,0x15,0x16,0x16,0x16,
	0x16,0x16,0x16,0x16,0x16,0x17,0x17,0x17,
	0x17,0x17,0x17,0x17,0x17,0x17,0x17,0x17,
	0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x18,
	0x18,0x18,0x18,0x18,0x18,0x18,0x18,0x18
};
const uint8_t Peukert_1_05_tbl[] = {
	0x10,0x11,0x11,0x11,0x12,0x12,0x12,0x12,
	0x12,0x12,0x12,0x12,0x12,0x12,0x12,0x13,
	0x13,0x13,0x13,0x13,0x13,0x13,0x13,0x13,
	0x13,0x13,0x13,0x13,0x13,0x13,0x13,0x13,
	0x13,0x13,0x13,0x14,0x14,0x14,0x14,0x14,
	0x14,0x14,0x14,0x14,0x14,0x14,0x14,0x14,
 };
#endif

/* Temperature sensor map from raw reading to degrees F. */
const uint8_t Temp_Table[45*8+1] = {
	0x05,0x07,0x09,0x0B,0x0D,0x0F,0x10,0x12,
	0x14,0x16,0x17,0x19,0x1A,0x1C,0x1D,0x1E,
	0x20,0x21,0x23,0x24,0x25,0x27,0x28,0x29,
	0x2A,0x2C,0x2D,0x2E,0x2F,0x30,0x31,0x32,
	0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,
	0x3C,0x3D,0x3E,0x3F,0x40,0x41,0x42,0x43,
	0x44,0x45,0x46,0x47,0x48,0x49,0x4A,0x4B,
	0x4C,0x4D,0x4E,0x4F,0x50,0x51,0x52,0x53,
	0x54,0x55,0x56,0x57,0x58,0x59,0x5A,0x5B,
	0x5C,0x5D,0x5E,0x5F,0x60,0x61,0x62,0x63,
	0x64,0x65,0x66,0x67,0x68,0x69,0x6A,0x6B,
	0x6C,0x6D,0x6E,0x6F,0x70,0x71,0x72,0x73,
	0x74,0x75,0x76,0x77,0x78,0x79,0x7A,0x7B,
	0x7C,0x7D,0x7E,0x7F,0x81,0x82,0x83,0x84,
	0x85,0x86,0x87,0x89,0x8A,0x8B,0x8C,0x8D,
	0x8E,0x90,0x91,0x92,0x93,0x95,0x96,0x97,
	0x99,0x9A,0x9C,0x9D,0x9E,0xA0,0xA1,0xA3,
	0xA4,0xA6,0xA7,0xA9,0xAA,0xAC,0xAE,0xAF,
	0xB1,0xB3,0xB5,0xB6,0xB8,0xBA,0xBC,0xBE,
	0xC0,0xC2,0xC5,0xC7,0xC9,0xCB,0xCE,0xD0,
	0xD3,0xD6,0xD9,0xDB,0xDE,0xE2,0xE5,0xE8,
	0xEC,0xEF,0xF3,0xF7,0xFB,0xFF,0xFF,0xFF,
	0x05,0x07,0x09,0x0B,0x0D,0x0F,0x10,0x13,
	0x14,0x16,0x17,0x19,0x1A,0x1C,0x1D,0x1E,
	0x20,0x21,0x22,0x24,0x25,0x26,0x27,0x28,
	0x29,0x2A,0x2C,0x2D,0x2E,0x2F,0x30,0x31,
	0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,
	0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,0x40,0x41,
	0x41,0x42,0x43,0x44,0x45,0x46,0x47,0x48,
	0x48,0x49,0x4A,0x4B,0x4C,0x4C,0x4D,0x4E,
	0x4F,0x50,0x51,0x52,0x52,0x53,0x54,0x55,
	0x55,0x56,0x57,0x58,0x59,0x5A,0x5B,0x5C,
	0x5C,0x5D,0x5E,0x5F,0x5F,0x60,0x61,0x62,
	0x63,0x64,0x65,0x65,0x66,0x67,0x68,0x69,
	0x6A,0x6B,0x6B,0x6C,0x6D,0x6E,0x6F,0x70,
	0x70,0x71,0x72,0x73,0x74,0x75,0x76,0x77,
	0x78,0x79,0x7A,0x7B,0x7C,0x7D,0x7E,0x7F,
	0x80,0x81,0x81,0x82,0x84,0x85,0x86,0x87,
	0x88,0x89,0x8A,0x8B,0x8C,0x8D,0x8E,0x90,
	0x91,0x92,0x93,0x94,0x96,0x97,0x98,0x9A,
	0x9B,0x9C,0x9D,0x9F,0xA0,0xA2,0xA3,0xA5,
	0xA6,0xA8,0xAA,0xAB,0xAD,0xAF,0xB0,0xB2,
	0xB4,0xB6,0xB8,0xBA,0xBC,0xBE,0xC0,0xC3,
	0xC5,0xC7,0xCA,0xCC,0xCF,0xD2,0xD5,0xD8,
	0xDB,0xDF,0xE2,0xE6,0xEB,0xEF,0xF4,0xF9,
	0xFE
};

const char TX_Table[] = "rtd-period \0"
"200\0"
"c-rr 15\r"
"bat-amps-lim 350\r\0"
"c-rr 5\r"
"bat-amps-lim 190\r";

static void INIT_LCD(void)
{
	/* Reset three times. */
	COMMAND8(0x30);
	MS_DELAY(10);
	COMMAND8(0x30);
	MS_DELAY(10);
	COMMAND8(0x30);
	MS_DELAY(10);

	COMMAND8(0x28);					/* Switch the LCD to 4 bit mode */
	COMMAND(0x28);					/* In 4 bit mode, configure for two lines */
	COMMAND(ON);
	COMMAND(0x06);
	return;
}

static void SECOND_LINE(void)
{
	COMMAND(LIN2);
	return;
}

/* Executes a command in the W reg to the LCD Module.
 * Precondition: module set to 4 bit mode.
 */
static void COMMAND(uint8_t cmd) __wparam
{
	RS = 0;		 /* Instruction/data select = 0 */
	LCDtemp = cmd;
	LCD = cmd & 0xF0;
	E = 1;						/* Set LCD enable */
	MDELAY(50);
	INTCONbits.GIE = 0;			/* Disable interrupts globally. */
	E = 0;
	MDELAY(50);
	swapf(LCDtemp);
	LCD = LCDtemp & 0xF0;  
	E = 1;						/* Set LCD enable */
	MDELAY(50);
	E = 0;
	INTCONbits.GIE = 1;			/* Re-enable interrupts. */
	/* Delay 500 usecs. The max delay per call is 255 usec.  */
	MDELAY(250);
	MDELAY(250);
	RS = 1;						/* Instruction/data select = 1 */
	return;
}

/* Send COMMAND to the LCD Module.
 * This is used briefly to switch into 4 bit mode.
 */
static void COMMAND8(uint8_t command)  __wparam
{
	RS = 0;		 /* Instruction/data select = 0 */
	LCD = command;
	E = 1;						/* Clock LCD enable */
	MDELAY(250);
	E = 0;
	MDELAY(250);
	MDELAY(250);
	RS = 1;						/* Instruction/data select = 1 */
}

static void DISPLAY(char c) __wparam
{
	RS = 1;						/* Instruction/data select to data. */
	LCDtemp = c;
	LCD = c & 0xF0;
	E = 1;						/* Clock LCD enable */
	MDELAY(40);
	INTCONbits.GIE = 0;			/* Disable interrupts globally. */
	E = 0;
	MDELAY(40);
	swapf(LCDtemp);
	LCD = LCDtemp  & 0xF0;  
	E = 1;						/* Clock in second nibble. */
	MDELAY(40);
	E = 0;
	INTCONbits.GIE = 1;			/* Re-enable interrupts. */
	/* Delay 500 usecs. The max delay per call is 255 usec.  */
	MDELAY(250);
	MDELAY(250);

	naked_return;				/* Should be implemented by the compiler */
}

/* Read the A/D channels and store the scaled results. */
static void A2DLoop(void)
{
	/* Set ADC right justified, 20 Tad conversion time, Fosc/32. */
	ADCON2 = 0xBA;
	ADCON0 = 1;
	temp = Vavg;
	Avg_div = 3;
	A2DAVG();
	Vavg = temp;
	if (Vpack_trim >= 0)
		avg += Vpack_trim;
	else if ((avg -= Vpack_trim) < 0)
			avg = 0;
	/* Hysteresis routine. */
	temp = Volt;
	Hysteresis();	/* '0' passed in W, but never used. */
	Volt = avg;
	/* Use the data from the motor controller if set. */
	if (Sys_Config.bAmpSource) {
		bAmp = bcAmp;
	} else {
		ADCON0 = 5;
		temp = Bavg;
		Avg_div = 5;
		A2DAVG();
		Bavg = temp;
		if (C_hours == 0) {
			if (C_minutes <= 1)
				LZstat.ChargeMode = 0;
			/* Clear temp compensation of SoC */
			if (C_minutes < 1)
				Sys_Config.bAmp300mVOffset = 0;
		}
		if ((avg -= 30) < 0) {					/* 300mV offset */
			/* Enter charge mode. */
			avg = -avg;
			/* If charging current is less than 3 amps, ignore. */
			if (avg > 2) {
				if ( ! CM_Delay)
					LZstat.ChargeMode = 1;
			} else
				avg = 0;
		}
		if (avg >= 2) {
			/* Hysteresis routine. */
			temp = bAmp;
			Hysteresis();	/* '2' passed in W, but never used. */
			bAmp = avg;
		}
#if defined(USE_LEM_HASS)
		Arg2 = bAmp;
		bAmp = Fracmult(29);
#endif
	}

	/* ADC channel 2, accessory voltage. */
	ADCON0 = 0x09;
	temp = aVavg;
	Avg_div = 3;
	A2DAVG();
	aVavg = temp;

