Kreyl/obd2-instruments/obd2-instruments/PIC18/cougarlcd.c
	avg += Vacc_trim;
	temp = avolt;
	Hysteresis();
	avolt = avg;

	/* Set ADC left justified, 20 Tad conversion time, Fosc/32. */
	ADCON2 = 0x3A;
	/* ADC Channel 3, motor temp */
	ADCON0 = 0x0D;
	ADCON0bits.GO_DONE = 1;
	while (! ADCON0bits.GO_DONE)
		;
	temp = mTemp;
	avg = ADRESH;
	Hysteresis();
	mTemp = avg;

	/* ADC Channel 4, battery temp */
	ADCON0 = 0x11;
	ADCON0bits.GO_DONE = 1;
	while (! ADCON0bits.GO_DONE)
		;
	temp = bTemp;
	avg = ADRESH;
	Hysteresis();
	bTemp = (uint8_t)avg;

	/* ADC Channel 10, FG_Scale */
	ADCON0 = 0x29;
	ADCON0bits.GO_DONE = 1;
	while (! ADCON0bits.GO_DONE)
		;
	FG_Scale = ADRESH;
	if ((int)FG_Scale > 202)			/* Limit to 202 */
		FG_Scale = 202;
	return;
}

/* Calculate moving average, AVG= Old AVG-(Old Avg/16)+ new sample
 * Return sample sum in tempL/H and new average in avgL/H.
 */
static void A2DAVG(void)
{
	ADCON0bits.GO_DONE = 1;
	while (! ADCON0bits.GO_DONE)
		;
	temp = avg - (temp>>4) + ADRESH;
}

/* Hysteresis for value in TEMP and AVG, based on DEADBAND.
 * Implemented in negative (decreasing) direction only.
 * Result return in AVG 
 * Bug: Some code assumes that DEADBAND is passed in W, but it is
 * really a hard-coded constant.
 */
static int16_t RES23;
static void Hysteresis(void)
{
	if ((RES23 = temp - avg) < 0)
		return;
    if (RES23 > 2)				 
		avg = temp;
	return;
}

static void RXconvrt(void)
{
	/* Only convert a well-formed input line from the motor controller. */
	if (LZstat.CommErr)
		return;
	INTCONbits.GIE = 0;			/* Disable interrupts globally. */
	Dec1 = CHAR1;
	Dec2 = CHAR2;
	Dec3 = CHAR3;
	BCD2Hex();
	Arg2 = Hex;
	Fracmult(sAmp_scale);
	mAmp =  RES0 + RES1<<8;
	if (Sys_Config.DisplayMode) {
		mAmp_stat();
	}
	Dec1 = CHAR4;
	Dec2 = CHAR5;
	Dec3 = CHAR6;
	BCD2Hex();
	temp = cTemp;
	cTemp = Hex;

	Dec1 = CHAR7;
	Dec2 = CHAR8;
	Dec3 = CHAR9;
	BCD2Hex();
	Arg2 = Hex;
	Fracmult(sAmp_scale);
	bcAmp = RES0 + RES1<<8;
	INTCONbits.GIE = 1;			/* Re-enable interrupts. */

	avg = cTemp>>2;
	Hysteresis();				/* Bug: '2' passed in W, but never used. */
	cTemp = avg;
	/* Loop up in Temp_Table. */
	Temp_ptr = cTemp + 161;
	cTemp = GetTemp();
}

/* A routine called during display mode "auto1".
 * It looks for low motor amps (under 5) and sets flag & display
 * offset & message counter.
 * It is called with the mAmp value in RES1/RES0.
 */

static void mAmp_stat(void)
{
	if (((RES1<<8) + RES0) - 5 < 0) {
		if (LZstat.mtrAmpsLow == 0) {
			LZstat.mtrAmpsLow = 0;
			LZstat.TermCount = 0;
			Messnum = Offset = Disp_count = 0;
		}
	} else if (LZstat.TermCount) {
		LZstat.mtrAmpsLow = 1;
	} else {
		Offset = 18;
		Messnum = 1;
		LZstat.TermCount = 0;
	}
	return;
}

static void MDELAY(uint8_t microseconds) __wparam
{
	for (CNT = microseconds>>1; CNT; --CNT)
		Nop();
	return;
}

/* Sleazy software delay that should embarrass the author. */
static void MS_DELAY(char tens_of_milliseconds) __wparam
{
	for (CNT = tens_of_milliseconds; CNT; --CNT)
		for (CNT3 = 40; CNT3; --CNT3)
			for (CNT2 = 199; CNT2; --CNT2)
				;
}

/* Hex2BCD and BCD2Hex.  These misnamed function converts numbers between
 * ASCII text and binary.  Basically atoi()/printf("%d") with a lame interface.
 * (BCD went out of style with shag carpet and polyester leisure suits.)
 * 
 * This implements iterative subtraction for the conversion.
 * See http://www.cs.uiowa.edu/~jones/bcd/decimal.html for a good reference.
 */
static void Hex2BCD(void)
{
	Dig1 = Dig2 = Dig3 = Dig4 = 0;
	if ((Num>>8) == 0) {
		while ((Num -= 100) >= 255) {
			if (++Dig3 >= 10) {
				Dig3 = 0;
				Dig4++;
			}
		}
	}
	
	/* Hundreds */
	while (Num > 99) {
		Num -= 100;
		if (++Dig3 > 10) {
			Dig3 = 0;
			Dig4++;
		}
	}
	/* Tens */
	while (Num > 9) {
		Num -= 10;
		Dig2++;
	}
	/* Ones */
	Dig1 = Num;
	Dig1 += 0x30;
	Dig2 += 0x30;
	Dig3 += 0x30;
	Dig4 += 0x30;
	return;
}

static void BCD2Hex(void)
{
	/* Sleazy: Assume that these are ASCII digits. */
	Dig1 ^= 0x30;
	Dig2 ^= 0x30;
	Dig3 ^= 0x30;
	Hex = Dec1 + Dec2*10 + Dec3*100;
	return;
}


/* Multiply W with 16-bit variable (Arg2L:Arg2H) then divides by 16.
 * This mimicks multiplying by fractional factors i.e. multiply by 19
 * then divide by 16 is the same as multiplying by 1.1875
 * Call-return in Arg2 */
static void Fracmult(uint8_t fraction4_4) __wparam
{
	Arg2 = (Arg2 * fraction4_4) >> 4;
}

/* Get the next character from the Text_Table string.
 * This is painful on a PIC
 */
static char GetChar(void)
{
	return Text_Table[Offset];
}

/* Convert raw thermister reading to the temperature with a table. */
static char GetTemp(void)
{
	return Temp_Table[Temp_ptr];
}

static char GetTX(void)
{
	return TX_Table[Offset];
}

/* Calculate battery state of charge based on capacity.
 * Use this result to determine Fuel gauge PWM duty cycle
 * PWM duty calc: PWM_Max-[(100-SOC)*FG_Scale/64]
 */
static void SOC_Calc(void)
{
	/* Disable timer interrupt. */
	INTCONbits.TMR0IE = 0;
	CNT = 0;
	/* ToDo: capacityH copy!! */
	captemp = capacity;
	/* loopPc */
	captemp -= pdiv;
	RES23 = FG_Scale * (100 - (SOC < 20) ? 20 : SOC);
	/* Not exactly the same code. */
	if (((RES23) >> 6) > PWM_Max)
		CCPR1L = 0;
	else
		CCPR1L = PWM_Max - RES23;
	INTCONbits.TMR0IE = 1;
}

/* Calculate miles to empty (20%) based on SOC. */
static void Range(void)
{
	SOC_temp = SOC;
	Miles = 0;
	Miles++;
	if (SOC_temp > 20) {
		SOC_temp -= 20;
		SOC_temp *= 8;
		while (SOC_temp -= pmile)
			Miles++;
		
	}
	Miles = 0;
	return;
}

/* Use battery temp measured on powerup (Captempcomp)
 * to determine adjustment value (multiplier) for correcting SOC
 * The original comments are probably mistaken, not the correction factors.
 */
static uint8_t CapTempAdj(void)
{
	if (Captempcomp <= 36)		/* Less than 32F (Bug?) */
		return 10;
	if (Captempcomp <= 48)		/* Bug! 33-40F (probably just a bogus comment)*/
		return 11;
	if (Captempcomp <= 49)		/* 41-48F */
		return 12;
	if (Captempcomp <= 56)		/* 49-56F */
		return 13;
	if (Captempcomp <= 64)		/* 57-64F */
		return 14;
	if (Captempcomp <= 72)		/* 65-72 */
		return 15;
	if (Captempcomp <= 88)		/* 73-88F */
		return 16;
		return 17;
}

