Kreyl/obd2-instruments/obd2-instruments/PIC18/cougarlcd.c
/* Suppress leading zeros.  Input is variable Digtemp. */
static char Zerosupress(void)
{
	if (LZstat.NegTemp) {
		LZstat.NegTemp = 0;
		return '-';
	}
	if (Digtemp == '0' && ! LZstat.LeadingZero)
		return ' ';
	LZstat.LeadingZero = 1;
	return Digtemp;
}

/* Handle activation of the pushbutton switch SW1
 * Debounce with a 50msec delay
 * increment message format counter "Messnum" and
 * set "Offset" to the correct text in the Lookup Table.
 */
static void Button(void)
{
	MS_DELAY(5);
	if ( ! SW1)
		return;
	/* Worst. Debounce. Ever. */
	do
		ClrWdt();
	while (SW1);

	if (++Messnum >= 3)
		Messnum = 0;
	Offset = Messnum * 18;
	return;
}

/* Handle activation of the pushbutton switch SW2
 * Debounce with a 50msec delay
 * increment message format counter "Messnum" and
 * set "Offset" to the correct text in the Lookup Table.
 */
static void TX_Mode(void)
{
	MS_DELAY(5);
	if ( ! SW2)
		return;
	if (GLED)
		OffsetH = Offset;
	CNT = 3;

#if 0
	LZstat.ProfileMode = 
	do
		;						/* No watchdog clear here? */
	while (SW2);
#endif
	return;
}

#define Arg2L  *((uint8_t *)&Arg2)
/* Convert Fahrenheit to Centigrade uhm Celsius. */
static uint8_t F2C(uint8_t fahrenheit) __wparam
{
	LZstat.NegTemp = 0;
	Arg2L = fahrenheit;
	if (Arg2L < 32) {
		Arg2L = 32 - Arg2L;
		LZstat.NegTemp = 1;
	} else
		Arg2L -= 32;
	Fracmult(9);
	return RES0;
}

static void Capstore(void)
{
	EE_count = 0;
	EEADR = 0;
	EEDATA = capacity>>8;
	EEsave();
	EEADR = 1;
	EEDATA = capacity;
	EEsave();
	return;
}

/* EEPROM write, described in datasheet, sec 7.4
 * Somewhat more complicated than it needs to be. */
static void EEsave(void)
{
    EECON1bits.EEPGD = 0;
    EECON1bits.CFGS = 0;
    EECON1bits.WREN = 1;		/* enable writes to data EEPROM */
	/* Critical sequence */
    INTCONbits.GIE = 0;			/* Disable interrupts */
    EECON2 = 0x55;
    EECON2 = 0x0AA;
    EECON1bits.WR = 1;			/* Start write */
	/* Less critical, wait for completion.  We could enable interrupts here. */
	/* Other code does:   while (EECON1bits.WR) ;  Hmmm.. */
	while (PIR2bits.EEIF)
		;
	PIR2bits.EEIF = 0;
	INTCONbits.GIE = 1;			/* Re-enable interrupts. */
    EECON1bits.WREN = 0;
}

static uint8_t EERead(uint8_t index) __wparam
{
    EEADR = index;
    EECON1bits.CFGS = 0;
    EECON1bits.EEPGD = 0;		/* Perhaps can be done only once. */
    EECON1bits.RD = 1;
    return EEDATA;
}
/* The original ASM file took 0x10c2 / 4290 bytes */

/*
 * Local variables:
 *  compile-command: "sdcc cougarlcd.c -mpic16 -p18f2480 --pno-banksel --fommit-frame-pointer --optimize-df --optimize-cmp -denable-peeps --no-crt --no-c-code-in-asm "
 *  c-indent-level: 4
 *  c-basic-offset: 4
 *  tab-width: 4
 * End:
 */
